Build DiscussIt widget and moderator portal
